In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./launches.csv')

In [6]:
df

  Company Mission Name        Location  Date
0    NASA      Hubble1  Cape Canaveral  2010
1    NASA      Hubble2  Cape Canaveral  2010
2    NASA      Hubble3  Cape Canaveral  2010
3    NASA      Hubble4  Cape Canaveral  2010
4     ESA         ISS1  Wollops Island  2011
5     ESA         ISS2  Wollops Island  2012
6     ESA         ISS3  Wollops Island  2013
7     ESA         ISS4  Wollops Island  2014

In [5]:
df[df['Company'] == 'NASA']

  Company Mission Name        Location  Date
0    NASA      Hubble1  Cape Canaveral  2010
1    NASA      Hubble2  Cape Canaveral  2010
2    NASA      Hubble3  Cape Canaveral  2010
3    NASA      Hubble4  Cape Canaveral  2010

In [8]:
list(df.groupby('Company'))

[('ESA',   Company Mission Name        Location  Date
  4     ESA         ISS1  Wollops Island  2011
  5     ESA         ISS2  Wollops Island  2012
  6     ESA         ISS3  Wollops Island  2013
  7     ESA         ISS4  Wollops Island  2014),
 ('NASA',   Company Mission Name        Location  Date
  0    NASA      Hubble1  Cape Canaveral  2010
  1    NASA      Hubble2  Cape Canaveral  2010
  2    NASA      Hubble3  Cape Canaveral  2010
  3    NASA      Hubble4  Cape Canaveral  2010)]

In [11]:
df.sort_values('Date', ascending=False)

  Company Mission Name        Location  Date
7     ESA         ISS4  Wollops Island  2014
6     ESA         ISS3  Wollops Island  2013
5     ESA         ISS2  Wollops Island  2012
4     ESA         ISS1  Wollops Island  2011
0    NASA      Hubble1  Cape Canaveral  2010
1    NASA      Hubble2  Cape Canaveral  2010
2    NASA      Hubble3  Cape Canaveral  2010
3    NASA      Hubble4  Cape Canaveral  2010